{
    "schema": {
        "fields": [
            { "name": "index", "type": "integer" },
            { "name": "title", "type": "string" },
            { "name": "description", "type": "string" },
            { "name": "when", "type": "string" },
            { "name": "where", "type": "string" },
            { "name": "linkImage", "type": "string" },
            { "name": "explorer", "type": "string" },
            { "name": "explorer_reference_link", "type": "string" },
            { "name": "city", "type": "string" }
        ],
        "pandas_version": "0.20.0"
    },
    "data": [
        {
            "index": 0,
            "title": "Here's the tea: The first ever Seattle Boba Fest is happening in the U District this weekend",
            "description": "Bubble Tea is a drink that folks either love or hate. But here in Seattle, plenty of people are fans of the sweet and satisfying drink. That’s evident in the sheer number of boba shops our city has and also makes sense as to why the first-ever Seattle Boba Fest is happening this weekend! Seattle Boba Fest is happening in the U District with the event page stating that the “U District is fast becoming the heart of the boba scene in Seattle.” It is also a celebration of National Bubble Tea Day which happens to be April 30th. Recent Posts:\nYou can celebrate an authentic medieval Mayday at Camlann Village this weekend\nMaris Farms Baby Animals and Blooms Days kick off this weekend & here’s what to expect  Festival attendees will be able to enjoy 16 unique boba drinks like cream strawberry, white rabbit candy milk tea, TieGuanYin latte, and more. There are also 2 unique boba-centric desserts being offered including vanilla soft serve with brown sugar boba and milk tea ice cream with boba topping. Talk about yummy! This event is only happening for one day only so be sure to mark your calendars. There’s no festival admission, all you have to do is show up to one or a few of the participating boba shops and enjoy. Psst, the festival has a handy map that you can find on their website. ",
            "when": "April 30th",
            "where": ": U District",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/04/cover-46-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 1,
            "title": "This Capitol Hill wine shop offers a monthly natural wine club subscription",
            "description": "Picking the perfect bottle can be hard, really hard. Wouldn’t it be great if someone could just do it for you? Well, it turns out they can, Capitol Hill’s La Dive has a wine club perfect for folks looking to explore. Here’s how it works. Each month, La Dive select’s their favorite natural wines for their club members. That means when you sign up you can choose between three different subscription options. The first option is two bottles a month for $42, then four bottles a month for $84, or six bottles a month for $120. Recent Posts:\nThe chef behind Bainbridge Island’s Hitchcock is opening a new resto next month\nWashington State Ferries bringing beer, popcorn & more back this month  On the first Monday of each month, you’ll be able to head over to the shop to pick up your order and start your month on a high note! And if you end up finding a new favorite bottle, you’re in luck because you get a 10% off coupon for your next purchase in shop. Pretty great deal huh? Beyond the wine club, La Dive has a full bottle list and drink & eats menu. So start your wine exploration at home and visit the shop for a night out on the town. You’ll probably discover that you’ve found the new perfect spot to meet friends. Enjoy! ",
            "when": " 721 E Pike St",
            "where": ": Daily 3 pm-2 am",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/04/cover-41-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 2,
            "title": "The chef behind Bainbridge Island's Hitchcock is opening a new resto next month",
            "description": "Bainbridge Island is already worth the visit but now foodies are going to have an extra reason to ride the ferry. Brendan McGill of Hitchcock is opening Seabird, a brand new restaurant in the former Hitchcock space. Here’s what you can expect. Seabird is set to be a seafood and vegetable-focused restaurant that will open on May 26th. It’s a revitalization of the old Hitchcock space with a sharper menu and complete kitchen renovation and dining room refresh. Expect an overall PNW beach vibe with nautical-themed works of art. Recent Posts:\nLucky Envelope Brewing is hosting a series of tasty pop ups this May & you don’t want to miss out\n10 of the best places to go glamping in Washington  So what can you expect to see on the menu? You’ll be able to find an iced shellfish section with a “rotating selection of local oysters, and other gems from the sea like spot prawns, geoduck, and green sea urchin.” Additionally, you’ll be able to find small plates like albacore tartare, octopus salad, chinook salmon Crudo, and more. There will also of course also be large plates like wood-fired halibut with summer squash, black garlic mole, and squash blossom, as well as seared sturgeon with potato fondant, kumquat kosho beurre blanc, and roasted little gems among others. And yes, there’s a thirst-quenching wine and cocktail program that will also accompany the menu. Until Seabird opens you can keep up with updates on their Instagram.  Enjoy! ",
            "when": "133 Winslow Way East #100, Bainbridge Island, WA",
            "where": ": Opens May 26th",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/04/cover-33-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 3,
            "title": "Lucky Envelope Brewing is hosting a series of tasty pop ups this May & you don't want to miss out",
            "description": "May is Asian American, Native Hawaiian, and Pacific Islander Heritage Month aka AANHPI! In order to celebrate Lucky Envelope Brewing will be serving up limited-edition beers and tasty pop-ups that you don’t want to miss out on. Let’s get into the details. The event kicks off on Friday, May 6th with the Tasting Room releasing weekly limited availability beers. They’ll also be hosting AANHPI-owned food vendors twice weekly. Some of those vendors include Mike’s Shave Ice, Kathmandu MoMoCha Food, Panda Dim Sum, and more. Recent Posts:\nThree Washington cities just ranked among the most physically active in the US\nThe Station is hosting a night market this Friday and you don’t want to miss it  While this month of food pop-ups and limited edition brews is already a must-visit, you can feel good knowing that your purchases are giving back. A portion of all May Tasting Room beer sales will be donated to the Asian American Journalist Association’s Seattle Chapter and also to the Very Asian Foundation. Cheers to that! If that wasn’t enough for you, there will also be journalist spotlights throughout the month. These spotlights feature both past and current members of the journalism industry. The spotlights are meant to educate the public on why diversity and inclusion are important in the industry. Keep up with all of the tasty deets at Lucky Envelope Brewing’s Instagram. Enjoy! ",
            "when": "Throughout May",
            "where": ": 907 NW 50th Street",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/04/cover-32-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 4,
            "title": "Money Frog is Capitol Hill's newest spot for pan-Asian eats & it opens tomorrow",
            "description": "It looks like Seattle’s restaurant scene is only getting better and better, with yet another new addition from the folks behind Taurus Ox and Hangry Panda. The new spot is called Money Frog, continuing on with the theme of cute animal names. It serves up pan-Asian cuisine in the former location of Capitol Hill’s Vios. If you ever dined at Vios in the past then you’ll know there’s plenty of room while still remaining cozy. That being said, Money Frog is looking like a great place to enjoy meals with a group of pals. Especially when you see all the delicious items on the menu. Recent Posts:\nFoodie Fest is bringing together 13 of Seattle’s most popular pop ups this April\nSeattle Restaurant Week is back and on now with over 200 participants  You can dine on items like condensed milk peanut prawns, soft shell chilli crab, and green beans. You’ll also find menu items like fried frog legs, cacio e pepe with yakisoba noodles and curry ketchup fried rice. Our mouths are already watering. If you’re ready to give them a try you’re in luck because Money Frog’s grand opening is tomorrow, April 13th. You’ll be able to get a first taste at the menu as well as drinks. Why not have a hump day celebration? Happy eating! ",
            "when": " 903 19th Ave E",
            "where": ": Grand opening April 13th, Wednesday-Sunday 4 pm-9 pm",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/04/cover-11-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 5,
            "title": "Foodie Fest is bringing together 13 of Seattle's most popular pop ups this April",
            "description": "This spring is full of food festivals and now its time to add one more to your list of events to check out. Foodie Fest is being put on by locally owned restaurant group Heigh Connects and is bringing together 13 of the most popular Seattle pop ups for you to enjoy. Let’s get into the tasty details. Foodie Fest I taking place later this April at The Stone House Cafe. You’ll find a mix of food, retail and even live sets from local DJs. Food will be available outside from individual vendors and drinks  will be available inside Stone House. Recent Posts:\nSeattle Restaurant Week is back and on now with over 200 participants\nSee more than 80 life size dinosaurs at this new immersive exhibit in Seattle  The participating food vendors include Sea Sandwich, Your Kuyas, Puffy Pandy, Ramen Ramen, Grayseas Pies, Mike’s Shave Ice, Laina’s Handcrafted Ice Cream, Jay Blue Thai, and Half Lion Brewing. Best of all there are no tickets for this event, you simply have to show up and enjoy the eats. That being said, as is the case with most pop ups, items will probably only be available while supplies last so be sure to be early if there’s a certain pop up you’re really craving. Enjoy foodies! ",
            "when": "April 23rd, 5 pm-9pm",
            "where": ": 9701 Rainier Ave S",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/04/BeFunky-collage-5-2-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 6,
            "title": "Seattle Restaurant Week is back and on now with over 200 participants",
            "description": "The tastiest bi-annual event of the year is on now! That’s right folks, Seattle Restaurant Week is back until April 16th with over 200 participating restaurants. It’s one of the best ways to satisfy your taste buds and also support Seattle’s culinary community. If you’ve never attended Seattle Restaurant Week before, featured restaurants offer a prix fixe dining promotion meaning you get a chance to try all sorts of great food. You can choose between $20 lunches and/or $35, $50 or $65 dinners. What’s more, you can choose between takeout or onsite dining, and this year, give meal options, as well as pop-ups, have been added. Recent Posts:\nWest Seattle could soon have it’s own transit gondola from the Junction to SODO\nThe Seattle plane building is nearing it’s final stages, here’s what’s new  No matter where you live, you should be able to participate as there are over 45 neighborhoods and cities in the Greater Seattle area represented. That means it’s almost guaranteed that a restaurant near you is participating. If you’re looking for something in particular the event’s website has an easy-to-use search tool that can help you break down your search by cuisine, neighborhood, cost, and more. Some of the notable participating restaurants this year include Monsoon, Nue, Rione XIII, and many more. Don’t miss out! ",
            "when": "April 3rd-16th",
            "where": ": Over 200 participating restaurants",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/03/BeFunky-collage-13-6-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 7,
            "title": "The Fairmont Olympic's stunning new restaurant officially opens today",
            "description": "Happy Monday Seattle! We know it’s not everyone’s favorite day of the week but today there’s a reason to celebrate. Why, you ask? Well because The Fairmont Olympic’s new restaurant, The George is finally opening after a much anticipated wait. The opening marks the end of the hotels $25 million dollar restoration project that began in January 2020. The restoration also included another notable spot, The Founders Club which opened earlier this year. That means you have more than one reason to check out the new and improved Fairmont. Recent Posts:\n5 hidden bars & speakeasies that you can visit in Seattle\nMariPili is Seattle’s newest Galician spot and is opening next month  The George will be run by newly appointed Restaurant Executive Chef Thomas Cullen. Chef Cullen will set the new restaurant apart with a brasserie-inspired menu. Expect a showcase of PNW seafood, dry-aged meats, produce, sustainably foraged items, and more. Some of the signature dishes include a traditional French bouillabaisse, The George seafood tower featuring a plethora of the sea’s best offerings, and Painted Hills bone-in short rib with heirloom carrots and natural jus. Of course, the menu will also be accompanied by an extensive bar program with hand-crafted signature cocktails created by Jesse Cyr, the hotel’s award-winning Beverage Curator. To fully package the experience, guests will be able to dine in a stunning interior by Spanish design studio Lázaro Rosa Violán (LRV). The new space balances the hotel’s classic elements while adding modern flair and is sure to end up on your Instagram feed. So what are you waiting for? Book yourself a reservation today. Enjoy! ",
            "when": "411 University Street",
            "where": ": Opening April 4th, Tuesday-Thursday 5 pm–9:30 pm, Friday & Saturday 5 pm–10:30 pm",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/04/BeFunky-collage-3-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 8,
            "title": "Seattle's newest Korean restaurant just opened in Ballard",
            "description": "Nothing quite like a new restaurant to help us all end our weekend on a high note! Ballard’s gastropub, The Gerald has a whole new identity thanks to chef Wes Yoo who has just opened WeRo earlier this March. The new restaurant is a Korean spot centered on comfort. Yoo decided to open the restaurant after seeing the effect the pandemic had on the city of Seattle. A brave choice as many long-standing restaurants closed for good. Nonetheless, Yoo believed that he could help bring comfort to the city through Korean food which he found so soothing throughout his early life. Recent Posts:\n12 amazing Seattle patios with great views of the city\nHere are 12 of the tastiest spots to grab sushi in Seattle  The restaurant’s goal is to show Seattle the different types of Korean cuisine, authentically reflecting the diversity of delicacies available on the peninsula. Some of the menu items you can enjoy include YookHweh (Korean style beef tartare with prime tenderloin), Salmon Jorim (king salmon seared and poached in spicy and sweet broth with daikon served with rice), and much more. WeRo also has a full bar including Korean drinks like soju and makgeolli so treat yourself this weekend and try something new or enjoy an old favorite! ",
            "when": " 5210 Ballard Ave NW",
            "where": ": Wednesday-Saturday 5 pm-10 pm",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/03/BeFunky-collage-7-9-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 9,
            "title": "Final Call: This is your last month ever to grab a brew at Hale's Ales",
            "description": "All good things must come to an end, including Hale’s Ales, one of the Northwest’s oldest and longest-running independently-owned breweries. While it is sad news, now is the perfect time to stop by grab a brew and celebrate. After all, it’s your last chance. Hale’s Ales was started in 1983 by Mike Hale and built a reputation over the years for full-flavored ales crafted using traditional English brewing methods. What’s more, Hale’s was the “first craft brewery to introduce Seasonal, Cask Conditioned, and Nitrogen Conditioned ales to the region.” That’s a pretty big deal! Recent Posts:\nCheers to this: A look at Seattle’s newest breweries\nHi Life is Bainbridge Island’s newest poke spot & is worth the ferry ride  Not only is Hale’s known for their brews but they’re also known for hosting the Moisture Festival, which by the way is happening right now. The brewery will be sorely missed by its many fans who have had a brew or two over Hales 39 year history. Especially because at this time it appears that Hales closure includes its production. Like many other businesses during the pandemic, Hale’s had a hard few years and owner Mike Hale is ready for retirement. So add a few more memories to this classic Seattle spot, you have until April 9th to grab a brew. Bring your friends, your SO, or maybe even your coworkers! ",
            "when": " 4301 Leary Way NW",
            "where": ": Monday-Friday 3 pm-9 pm and Saturdays 12 pm-9 pm, Closing April 9th",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/03/BeFunky-collage-4-11-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 10,
            "title": "Wolf and Woman & chef Tiffany Ran are collabing for an unforgettable pop up this April",
            "description": "There are tons of foodie centric events to look forward to in the coming months. Between food festivals and new farmers markets, your eating calendar is probably looking pretty full. But be sure to leave room on April 11th because Wolf and Woman and chef Tiffany Ran are collaborating for a pop up thats sure to be out of this world. Wolf and Woman opened in Seattle in 2017 with a focus on Malaysian Tamil cuisine and while the cuisine remains the same these days, they’re now based in San Diego. Chef Tiffany Ran is known for her uber popular pop up Ba Ba Lio Taiwanese which can often be found at Fair Isle Brewing. While both are equally delicious on their own, the collaboration of the two is sure to be a taste you won’t soon forget. Recent Posts:\nHi Life is Bainbridge Island’s newest poke spot & is worth the ferry ride\n10 of the best cafes to work remotely from in Seattle  The pop up dinner will take place at Lottie’s Lounge in Columbia City on April 11th and will have six dishes that blend  elements of Malaysian and Taiwanese cuisine. It’ll cost $55 per person. Here’s the deal, as both the resto and pop up are extremely popular, reservations are currently sold out. The good news is that you can join the waitlist which is probably worth doing considering the event is a month out and someone is bound to cancel. In the meantime you can always enjoy Ba Ba Lio and who knows, maybe just maybe, another seating will be added to this tasty event. ",
            "when": "April 11th",
            "where": ": 4900 Rainier Ave S",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/03/BeFunky-collage-15-3-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 11,
            "title": "Hi Life is Bainbridge Island's newest poke spot & is worth the ferry ride",
            "description": "In need of an excuse to get on island time? The owner of Rondo and Tamari Bar, Makoto Kimoto has you covered. Earlier this month he opened Hi Life, a new poke spot right next to the Bainbridge Island Ferry Terminal. The new spot is on the casual side with a main focus on poke. Customers can enjoy 12 types of poke bowls with classic garnishes like seaweed salad, imitation crab, tobiko and more. Some of the protein choices include multiple flavors of salmon, scallop, octopus among others. If you’re in the mood for a little bit of everything, there’s a bento style poke box to ensure you can experience it all. Recent Posts:\nHere are 12 of the tastiest spots to grab sushi in Seattle\nThe Seattle-Tacoma International Airport is about to get a major facelift  Beyond poke you’ll also be able to pick up Japanese curry as well as the famous Pike Place Chowder clam chowder topped with the addition of Hi Life’s house Japanese chilli oil. Additionally, you’ll also be able to pick up highballs, which only makes sense considering the drink is the restaurants name sake and will be the focus of the restaurants drink menu. So whether you’re looking for an excuse for a road trip, live on Bainbridge or already have a trip in the works, be sure to stop by Hi Life. As they are brand new hours are bound to change and fluctuate so be sure to check their Insta before making your trip. Enjoy folks! ",
            "when": "220 Olympic Dr SE",
            "where": ": 11 am-7 pm Thursday-Tuesday",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/03/BeFunky-collage-14-4-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 12,
            "title": "Kamino Sushi and More is Seattle's only Burmese resto & you can visit it in Uptown",
            "description": "Seattle has its fair share of diverse eats but not every cuisine is represented. For many years Seattleites have been missing out on Burmese cuisine, until now. Uptown’s Kamino Sushi and More is quietly serving up some of the country’s most popular dishes and you can try them. The restaurant describes itself as serving up “traditional sushi recipes blended with modern, mind blowing flavours.” What’s more, the restaurant has partnered with Master Chef Tin Tin Oo, the Season One winner of Master Chef of Myanmar in 2018-19. Her 12 years of experience in the art of Japanese Burmese cuisine inform the dishes that Kamino serves.  Recent Posts:\nSeattle is the most desired post-graduation destination for college students\n10 of the best cafes to work remotely from in Seattle Alongside a wide sushi menu, the restaurant offers three Burmese dishes. The star of the Burmese side of the menu is the Tea Leaf Salad aka Laphet Thoke. It’s made from fermented young tea leaf salad, shredded cabbage, slice tomato, fried dried bean, peanut, garlic, chili, sesame seed, and sesame oil. As Kamino Sushi and More is still relatively new on the scene they don’t have a big social media presence. So in order to get an idea of the dishes you’ll have to visit them yourself. Think of it as a unique new activity to add to your week, enjoy folks! ",
            "when": " 372 Roy St",
            "where": ": Monday-Saturday 1 pm-10 pm, Sunday 1 pm-5 pm",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/03/BeFunky-collage-3-5-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 13,
            "title": "Seattle's Lark restaurant has returned after a two year hiatus, here's what's new",
            "description": "Openings, closings, restrictions, liftings, delays, all the joys of living through several years of a pandemic. Ready for some good and tasty news? We’ve got you. Seattle’s Lark restaurant is open once again after a two-year hiatus during the pandemic. If you’re unfamiliar with Lark, the restaurant is known for serving up the best of the Pacific Northwest’s bounty. They work with local farmers, ranchers, fisheries, and foragers to serve the best of each season, creating delicious and truly seasonal dishes for diners to enjoy. If you’re all about farm to table, this is your spot. Recent Posts:\nDid you know? The history of Seattle’s Fremont Troll\n10 rocking concerts coming to Seattle this March  For their return Lark is serving up a four-course dinner menu that changes monthly and features locally-produced and organic cheeses, charcuterie, vegetables, grains, fish, and meats. These dishes are all prepared with the restaurant’s signature focus on flavor and quality. Some menu items include Palmer Ranch wagyu steak tartare, Squid ink spaghetti, Wild black cod, and Butterscotch budino among many. The dinner costs $120 per person and you can also add a $70 wine pairing should you choose. If you’ve been looking for an excuse to dine out, let this be it. ",
            "when": " 952 E Seneca St",
            "where": ": Tuesday-Saturday 5 pm-9 pm",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/03/BeFunky-collage-3-3-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 14,
            "title": "The Ellensburg Winterhop Brewfest kicks off next weekend",
            "description": "Looking to enjoy some brews this month? You’re in luck because the 18th Annual Ellensburg Winterhop Brewfest is on February 26th, 2022. It’s your chance to visit downtown Ellensburg and experience craft beer from local breweries, live music, shopping, and more. So what does this event entail? A $45 ticket to Winterhop Brewfest will include general admission into the event, a commemorative tasting glass, and 5 beer Sscrips. A $60 ticket includes early access to the event starting at 11:30 am, a commemorative tasing glass, 5 Beer Scrips, and a swag bag. Recent Posts:\nDowntown Seattle streets are actually brick & here’s why that’s cool\nYou can watch people race motorcycles on ice later this month in Washington  This year’s event features 21 breweries, 4 cider and/or seltzers, and 5 venues. Some names include Wander Hob, Blewett, Moonshot, and more. You’ll also be able to tune into performers like Jayleigh and The Lost Boys, Micah J, Spiced Rye, and more. Tickets are on sale now and considering that this event takes place next weekend we’d recommend purchasing those tickets ASAP. You can grab tickets and learn more at the Winterhop Brewfest website. Enjoy folks! ",
            "when": "February 26th",
            "where": ": Kittitas County",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/02/BeFunky-collage-14-3-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 15,
            "title": "Here's a first look inside The George, The Fairmont Olympic's new restaurant",
            "description": "In case you didn’t know, The Fairmont Olympic has been under a $25 million dollar restoration project since January 2020. And now all of that hard work is coming to a close with the opening of the hotel’s newest signature restaurant – The George. It’s an experience that both long-time and new Fairmont guests will enjoy. The George will be run by newly appointed Restaurant Executive Chef Thomas Cullen. Chef Cullen will set the new restaurant apart with a brasserie-inspired menu. What’s more, it will be a showcase of the PNW’s best offering, seafood. Patrons will be able to dine on the freshest seafood straight from local waters as well as dry-aged meats sourced from farms across the PNW. Recent Posts:\nCheck out these tasty pop ups in Seattle this week\nFremont’s newest vegan bakery serves beautifully decorated cakes That’s not all though, you can expect to find artisan cheeses, PNW produce, sustainably foraged items, and more. Some of the signature dishes include a traditional French bouillabaisse, The George seafood tower featuring a plethora of the sea’s best offerings, and Painted Hills bone-in short rib with heirloom carrots and natural jus. Of course, the menu will also be accompanied by an extensive bar program with hand-crafted signature cocktails created by Jesse Cyr, the hotel’s award-winning Beverage Curator. And all of this will happen in a fresh new interior by Spanish design studio Lázaro Rosa Violán (LRV). They’ve created a space that balances the hotel’s classic elements while adding modern flair. While we know you’re probably chomping at the bit to grab a reservation, you’ll have to wait until the restaurant’s opening on April 4th. But you can plan ahead and place your reservations as early as March 7th. ",
            "when": " 411 University Street",
            "where": "n/a",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/02/BeFunky-collage-5-3-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 16,
            "title": "Fremont's newest vegan bakery serves beautifully decorated cakes",
            "description": "A new addition to Seattle’s food scene is always a reason to celebrate, even more so when that addition is purpose-driven. Lazy Cow Bakery in Fremont has opened its doors after years of planning and is serving up plant-based treats as well as acting as a community space. If it sounds cool, it is so let’s get into some details. Lazy Cow Bakery is owned by Lara de la Rosa who has been serving up her delicious treats at the West Seattle Market. With the new permanent location, customers will be able to find a pastry menu with items like croissants, meringue tarts, flan, and much more. Additionally, customers will be able to order eye-catching hand-decorated cakes for all of their celebration needs. Recent Posts:\n15 of the most romantic Airbnbs you can find near Seattle\nHere’s a look at the world’s first NFT Museum in Seattle & it’s next show  That being said, de la Rosa wants to do more than just serve up delicious baked goods. So Lazy Cow Bakery is associated with the social justice organization, La Casa Del Xoloitzcuintle. It’s a “Latinx mutual aid organization that responds to the needs of the community.” The bakery comes into play here because it has a free community fridge & food pantry and donations are welcome anytime during the bakery’s normal business hours. So you can eat your cake and give it too. For now, Lazy Cow is offering beautiful Valentine’s Day boxes one for $25 that comes with a slice of red velvet cake topped with a chocolate strawberry and an almond croissant. And another in partnership with Frelard Tamales for $124 that comes with 15 mini tamales, flowers, vegan candles, and a taster box of Lazy Cow’s goodies. If you’re not in the market for a Valentine’s Day box your best bet is to keep up with Lazy Cow on social media as they’ll be having a grand opening later this month. ",
            "when": " 3418 Fremont Ave N",
            "where": "n/a",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/02/BeFunky-collage-2-2-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 17,
            "title": "Dough Joy just opened its first permanent location on Capitol Hill",
            "description": "In May 2021, Seattle was blessed with a brand new vegan donut food truck, Dough Joy. It was sorely needed in a city that has fewer vegan options than one may expect. Understandably, it’s taken off and as a result of its popularity now has a permanent home on Seattle’s Capitol Hill. Dough Joy’s Capitol Hill store opened its doors just last week to a perfectly pink interior with a minimalistic design so that you can focus on choosing your donut. Because when there are so many options, it’s hard to choose. You’ll find all your old favorite donut flavors, as well as some new ones. Recent Posts:\nOnigiri pop-up Sankaku just opened a permanent location on Capitol Hill\n6 Lunar New Year events and eats to check out in Seattle this year  According to the store’s Instagram, Birthday Cake was the most popular new flavor. Keep in mind that they regularly rotate and create new flavors, so you might just find a new fave each time you visit. And while the store works out all of its newnesses, they will be open until sold out each day and keep the food truck closed for the time being. So treat yourself this week, head over to Capitol Hill, and nosh on a delicious plant-based donut. Psst if you grab a coffee, be sure to ask to have your drink topped with the pink plant-based whip, yes it’s a real thing. Enjoy! ",
            "when": " 1316 E Pike St",
            "where": ": Thursday-Sunday 8 am until sold out",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/01/BeFunky-collage-3-9-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 18,
            "title": "Seattle's Life on Mars just released a hemp-based, non-alcoholic drink menu",
            "description": "Want to head to the bar without the buzz? Then a trip to Mars is in order, well, Capitol Hill’s Life on Mars that is. The bar is more than a bar, it’s also a record shop and restaurant. And now they’re adding non-alcoholic drinks to their line up of things to be known for. Last weekend, Life on Mars released a special menu featuring 9 non-alcoholic cocktails just in time for Dry January. These 9 drinks feature Pathfinder, a “fermented and distilled hemp-based liquid with the intense flavor and aromatic characteristics of a spirit.” That means you can get the taste of alcohol with out the harmful effects. Recent Posts:\nOnigiri pop-up Sankaku just opened a permanent location on Capitol Hill\nHere are 5 unique heated patios worth visiting in Seattle this month Some of those drinks include a Pathfinder Spritz made with Pathfinder N/A Amaro, Citrus, Soda and the N/Americano made with Pathfinder, Giffard Aperitif and Soda. All of the drinks have inventive names and flavours with something for everyone. Its a great way to try non alcoholic cocktails if you’ve been curious and also if you want to go out and hit the bar with your friends in a sober friendly way. According to Eater Seattle, on the 26th of January even more non-alcoholic cocktails will be released. This release is part of Life on Mars’ “N/A in the Mix”, a special evening of non alcoholic drinks on the last Wednesday of every month. So get out there and treat yourself to this unique limited time beverage menu while you can. ",
            "when": " 722 E Pike St",
            "where": ": Tuesday & Wednesday 4 pm-11 pm, Thursday 4 pm-12 am, Friday 4 pm-2 am, Saturday 10 am-2 am, Sunday 10 am-11 pm",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/01/BeFunky-collage-2-11-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 19,
            "title": "Onigiri pop-up Sankaku just opened a permanent location on Capitol Hill",
            "description": "Love hole in the wall spots? Well, Seattle’s beloved Sankuku pop-up just opened its first permanent location inside of Melrose Market. It’s not exactly a hole in the wall but it’s tucked away and if you didn’t know where to look you might just miss it. Let’s check it out. Sankaku opened its doors right next to Butter Home inside of Melrose Market in early January. Their spot is small, minimal and features a white and bright decor. They’ve started off slow and steady with a small menu full of delicious items. You can score onigiri with fillings like ume, salmon basil, tuna mayo, and more. Recent Posts:\nHere are 5 new restaurants in and around Seattle to check out now\nHere are 5 unique heated patios worth visiting in Seattle this month  They also serve up side dishes like a cabbage salad, sesame cucumbers, and hijiki nimono, a salad with mixed veggies and hijiki seaweed. That’s not all though, they also serve up sake, bubbles, and some soft drinks as well. So stop by for lunch or head over after work for a bite and a drink. Be sure to check Sankaku’s Instagram for current hours as they appear to change regularly. That being said if you’re in the area it’s well worth swinging back to see if they’re open treat yourself to an onigiri. ",
            "when": " 1527 Melrose Ave",
            "where": "n/a",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/01/BeFunky-collage-22-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 20,
            "title": "Field to Table returns next month with over 20 menus to choose from",
            "description": "The first-ever dining series on a professional sports field returns to Seattle this February. Field to Table is your chance to dine on eats from some of the city’s best chefs in an intimate dining experience on the turf. It’s 20 days of tasty goodness that you don’t want to miss out on. Field to Table takes place throughout February with a new menu every single day. Some of the featured chefs include Mel Miranda of Musang, Kristi Brown of Communion, and Maximillian Petty of Eden Hill. Menu items’ ingredients are diverse, ranging from foraged mushrooms to wagyu beef to heirloom citrus. Recent Posts:\nThese are Seattle Public Library’s most popular books of 2021\nHere are 5 new Seattle restaurants to check out this January  Like last year’s event, diners will be seated in a tent on the field. The experience lasts between 1.5-2 hours and you will be able to purchase drinks. That means everyone attending must be 21 or older. As with last year’s event, reservations are going quickly so book yours ASAP. In order to attend, you will need to provide proof of COVID-19 vaccination or a negative COVID-19 test result taken within 72 hours prior to the event. As the event is taking place inside of Lumen Field, a clear bag policy is in place. ",
            "when": "February 1st-20th",
            "where": ": 800 Occidental Avenue South",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/01/fieeld-to-table-1265x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 21,
            "title": "Seattle's newest cafe is all about being low waste & sourcing locally",
            "description": "We all love a good cafe, especially a brand new one! Bake Shop is Seattle’s newest cafe and venture from Hot Cakes former director of operations Krista Nelson and London Plane alum Madeline McDonald. What sets this new cafe apart is its dedication to staying low waste. Bake Shop believes that “a responsible business takes care of the planet.” That’s why they work to reduce waste through sourcing in bulk, working with local farms, and not using single-use plastic in their kitchen. They also encourage customers to bring their own mugs and to-go containers, offering $.25 off when you bring your own cup. Recent Posts:\nWunderground has opened its first cafe in Seattle with a full drink & eats menu\nCirque du Soleil returns to Seattle next week with a brand new show  Bake Shop is an all-day café meaning you’ll find a menu full of options like house-made baked goods, sourdough bread, as well as a small savory menu with toasts, sandwiches, and salads. Additionally, you can sip on coffee, loose leaf teas, beer, and wine. Give them a visit for breakfast, lunch, or before the next show at Climate Pledge Arena. Or you can always order online for pick up if you’d rather enjoy your eats at home. Be sure to double-check Bake Shop’s socials for hours before you head out. Enjoy folks! ",
            "when": "221 1st Ave W",
            "where": ": Tuesday-Friday 7 am-7 pm, Saturday & Sunday 8 am-7 pm",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/01/BeFunky-collage-9-1-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        },
        {
            "index": 22,
            "title": "This Seattle pop-up serves a new hyper-local & organic menu every 2 weeks",
            "description": "It’s no secret that Seattle has a great, ever-evolving food scene. Throughout the pandemic, we’ve watched as dining standards have completely changed. From upscale dine-in experiences to pop-up and takeout dining models. And if you consider yourself a local foodie, we have a pop-up with a hyper-local focus that you might just want to try. Three Sacks Full is a pop-up from Chef Michael Tsai and Sommelier Matthew Curtis. Together the duo has created a pop-up with a focus on organic vegetables, grains, and locally sourced ingredients as well as wines to accompany them. What makes this pop-up extra cool is that they grow the majority of ingredients on their very own Snoqualmie Valley farm. Recent Posts:\nA new bookshop that pairs unique reads and natural wine is opening in Seattle\nYou can take a real class called “Calling Bullsh*t” at the University of Washington  Because of their dedication to their craft and hyper locality, you’re not only getting delicious and wholesome meals, but you’re also supporting the regional food loop that keeps Washington thriving. What’s more, this pop-up releases a new menu every two weeks, so you can try seasonal produce and maybe even get inspired to cook up your own meals using ingredients from the PNW. Some past menu items have included wild yellow foot chanterelle and heirloom bean stew, pasture-raised chicken stew with violet queen turnips, and grilled sourdough flatbread to name just a few items. The menus feed 1-2 people making it a great choice for switching up your weekly dinner menu or sharing with a friend or SO. The next pop-up menu goes live on January 15th and you’ll be able to pick up your meal on either Tuesday, January 18th, or Wednesday, January 19th. If you’d like to learn more or sign up for pop-up updates you can click below. ",
            "when": "Every 2 weeks",
            "where": ": Tuesday pick up at Ebb & Co. 3404 NE 55th St, Wednesday pick up at La Medusa 4857 Rainier Ave S",
            "linkImage": "https://curiocity.com/wp-content/uploads/2022/01/BeFunky-collage-6-1255x600.jpg",
            "explorer": "curiocity",
            "explorer_reference_link": "https://curiocity.com/seattle/",
            "city": "Seattle"
        }
    ]
}
